#include<stdio.h>
#include<stdlib.h>
#include<time.h> 
#include<string.h>
#define SIZE 50 
struct exercises{
	int id;                 	//题号 
	char que[200];        //问题
	char ans[4][200];				//答案（不是答案标号） 
	char rans[10];                       //正确答案的标号 //改为字符串 
};  
int main()
{
	int i,j,k;
	char a[100],b;
	int cnt=0,sign;  //sign用作除去未知的输入两次的错误 ,还没有用过 
	struct exercises question[100] =
	{
		{101,"1-1.以下各项都是项目的特点，除了（  ）。",{"独特性","重复性","时限性","目的性"},"B"},
		{102,"1-2.与传统的项目管理相比较，现代项目管理中更加重视（  ）。",{"成本管理","沟通管理","时间管理","风险管理"},"C"} ,
		{103,"1-3.项目的共同特点有（  ）。",{"明确的起止日期","预定的目标","采用相同的开发方法","受到资源的限制"},"ABD"},
		{104,"1-4.项目管理的对象是（  ）。",{"项目","项目团队","项目的生命周期","项目干系人"},"A"},
		{105,"1-5.日常管理与项目管理的区别在于（  ）。",{"管理方法","责任人","组织机构","收益大小"},"AC"},
//		{,"",{"","","",""},""},
		{201,"2-1.随着项目生命周期的进展，资源的投入（  ）。",{"逐渐变大","逐渐变小","先变大后变小","先变小后变大"},"C"},
		{202,"2-2.人员在（  ）组织结构中通常向两个或多个上级报告。",{"职能型","项目型","矩阵型","混合型"},"C"},
		{203,"2-3.软件项目的生命周期可以从（  ）的角度进行认识。",{"项目的承担方","客户的角度","项目的类型","采用的技术"},"AB"},
		{204,"2-4.项目的复杂性和多样性要求项目经理具备（  ）",{"领导能力","建设项目团队的能力","冲突处理的能力","解决问题的能力"},"ACD"},
		{205,"2-5.项目的外部环境包括（  ）。",{"法规和标准","经济环境","项目组织文化","社会的文化和意识"},"ABD"},
		{301,"3-1.关于项目终结的表述，不正确的是（  ）。",{"表示项目实质工作已经停止\n","项目结果正在交付用户使用或者已经停滞\n","项目资源已经转移到其他项目中\n","项目在有可能的情况下还可能有一定的进展\n"},"D"},
		{302,"3-2.在启动一个IT项目时，应该明确（  ）。",{"项目的可行性","项目的目标","识别需求","历史资料"},"B"},
		{303,"3-3.项目正式启动的明确标志是（  ）。",{"召开启动会议","任命项目经理","可行性研究","以上皆是"},"AB"},
		{304,"3-4.所有经批准的变更都应反应映在（  ）当中。",{"质量保证计划","变更管理计划","项目计划","风险应对计划"},"C"},
		{305,"3-5.在项目变更的整体控制时，应该（  ）。",{"改变项目业绩衡量的指标体系","确保项目的工作结果与项目的计划相一致","遵循成本效益原则","注意协调项目的各方面的变化"},"BD"},
		{401,"4-1.(  )是一个项目中可交付成果为导向的涉及所有工作的一种分组，它定义了项目的整体范围。",{"范围说明书","WBS","工作包","范围管理计划"},"B"},
		{402,"4-2.范围（  ）通常是通过客户体验来完成的，然后以关键交付成果收尾。",{"核实","验证","完成","结束淘汰"},"A"},
		{403,"4-3.关于WBS，以下说法不正确的是（  ）。",{"WBS是最底层的项目通常称作工作包","因为工作包在WBS最底层，所以不可以再分","对于一个较大的项目，WBS的结构通常分为4~6层","WBS的第一层为可交付成果"},"B"},
		{404,"4-4.工作的分解可以从（  ）角度进行分解。",{"按照项目的不同阶段","按照专业划分","按照项目的交付成果","按照人员的专长"},"AC"},
		{405,"4-5.项目范围变更申请可以是（  ）。",{"口头的","书面的","由外部引起的","由内部引起的"},"CD"},
		{501,"5-1.所谓的关键路径即（  ）。",{"决定项目最早完成日期的活动路线","是项目网络图中最短的路线","关键路径是固定不变的，在网络图中不受其它活动的影响","关键路径中的活动是最重要的"},"A"},
		{502,"5-2.项目计划的主要目的，就是知道项目的（  ）。",{"成本控制","计划进度","范围核实","具体实施"},"D"},
		{503,"5-3.绘制网络活动不必考虑（  ）。",{"网络活动的表示形式（活动以节点还是以箭线表示）","活动的先后逻辑关系","网络图中事件编号","网络图中的箭线长短"},"D"},
		{504,"5-4.运用PERT技术可以（  ）。",{"估计整个项目的完成时间","估计项目中完成某项工作的时间","估计整个项目在某个时间内完成的概率","估计整个项目在某个时间内完成某项工作的概率"},"A"},
		{505,"5-5.运用PERT或CPM，项目管理者不能获得的信息是（  ）。",{"项目的持续时间估计","确定哪些活动是关键的","随着时间进度项目经费使用情况","某些项目可压缩的时间"},"C"},
		{601,"6-1.在运行项目成本管理时，需要编制资源计划，其目的是（  ）。",{"估计完成项目所需的资本成本","确定完成项目所需的资源","确定可用的资源","为估计项目的成本提供依据"},"BD"},
        {602,"6-2.虽然成本估算与成本预算的目的和任务都不同，但两者有共同的依据，即（  ）。",{"历史资料","项目需求说明书","工作分解结构","资源计划"},"C"},
		{603,"6-3.下面有关成本估算和成本预算的说法，正确的是（  ）。",{"/t成本估算是对完成项目各项任务所需资源的成本进行的近似估算\n","成本预算在项目成本估算的基础上，更精确地估算项目总成本\n","成本估算的输出结果是成本预算的基础与依据\n","成本预算则是将已批准的估算进行分摊"},"ABC"},
		{604,"6-4.如果进度偏差与成本偏差是一样的，两者都大于0，那么下列表述错误的是（  ）。",{"项目实际成本比计划低","项目成本超支","项目进度滞后","项目进度比计划提前"},"BC"},
		{605,"6-5.成本控制的例外差异分析中确定“例外”的标准是（  ）。",{"重要性","可控性","一贯性","特殊性"},"ABCD"},
		{701,"7-1.在项目中，质量是（  ）。",{"与客户期望的一致","“镀金”以便是顾客满意","与要求、规范及适用性一致","与管理当局的要求一致"},"C"},
		{702,"7-2.以下不属于软件质量要求要素的是（  ），",{"完整性","可理解性","性价比","可用性"},"C"},
		{703,"7-3.软件质量标准不包括（  ）。",{"过程标准","建模标准","安全保密标准","开发方法标准"},"D"},
		{704,"7-4.项目质量管理过程中，（  ）是判断质量标准与项目相关，并且通过项目质量管理使项目达到这些质量标准。",{"质量规划","质量保证","质量控制","质量持续改进"},"A"},
		{705,"7-5.质量体系包括（  ).",{"质量管理体系","质量控制体系","质量保证体系","质量测试平台"},"AC"},
		{801,"8-1.知识型员工不具备的特征是（  ）。",{"自住性高","成就动能强","崇尚权威","大多都忠于职业"},"C"},
		{802,"8-2.在项目管理中，将任务与责任人对应关系的图表，叫作(  )。",{"优先网络图","工作分解结构","关键路径","责任分配矩阵"},"D"},
//		{,"",{"\t\n","\n","\n",""},""},
		{803,"8-3.激励理论中的双因素理论，涉及一个叫作“保健因素”的概念，它指的是（  ）。",{"\t能影响和预防员工不满意感发生的因素\n","能预防员工心理疾病的因素\n","能保护员工心理健康的因素\n","能影响和促进员工工作满意的因素"},"A"},
		{804,"8-4.一名项目经理，对自己手下人常说的一句话是：“不好好干回家去，干好了可以多拿奖金。”可以认为，项目经理把他的手下都看作了（  ）。",{"\t只有归属需求和安全需求的人\n","只有生理需求和归属需求的人\n","只有生理需求和安全需求的人\n","只有安全需求和尊重需求的人"},"C"},
		{805,"8-5.高效项目团队的特征是（  ）。",{"\t对项目目标的清晰理解\n","每位成员的角色和责任界定明确\n","队员之间不沟通\n","团队是士气高涨"},"AB"},
		{901,"9-1.缺乏沟通和为解决的争端意味着（  ）。",{"复杂的项目","失败的进度计划","低效率的项目团队","项目团队的指责界定不明确"},"C"},
		{902,"9-2.沟通计划制定的基础是（  ）。",{"沟通需求分析","项目范围说明书","项目管理计划","历史资料"},"A"},
		{903,"9-3.现代观点认为冲突是（  ）。",{"是破坏性的","可能是有益的，取决于和谁发生冲突","如果得到控制，是有益的","以上皆是"},"B"},
		{904,"9-4.除了防范之外，项目经理最常用的解决冲突的方法是（  ）。",{"正视","缓和","回避","竞争"},"A"},
		{905,"9-5.在（  ）情况下，项目组需要与客户进行正式的书面沟通。",{"项目的产品出现问题","项目进度拖延","项目成本超支","客户提出了超出合同要求的工作"},"BD"},
		{1001,"10-1.在项目管理过程中，最严重的风险通常出现在项目生命周期的（  ）阶段。",{"启动和计划阶段","计划和实施阶段","实施和收尾阶段","启动和收尾阶段"},"A"},
		{1002,"10-2.项目风险的应对方法包括（  ）。",{"\t风险识别、风险评估、风险应对、风险监控\n","风险事件、风险征兆、风险条目检查\n","头脑风暴法、专家判断法、情景分析法\n","风险转移、风险回避、风险化解、风险分担"},"D"},
		{1003,"10-3.在下面的情况中，通过风险转移来降低风险的例子是（  ）。",{"担保","合同","应急计划","发包"},"A"},
		{1004,"10-4.导致项目风险造成的后果应从（  ）方面来衡量。",{"风险后果的大小","风险后果的性质","项目风险的影响","风险后果的时间性"},"AC"},
		{1005,"10-5.以下选项中，（  ）是项目风险管理的目的。",{"\t识别可能影响项目范围、质量、时间和成本的因素\n","对多有已识别的风险应对计划\n","为能控制的项目因素制定基准计划\n","通过影响能够被控制的项目因素而减轻影响"},"AD"},
	};
//	char a[50] = {"这是第一个问题"};
//	printf("%s\n",a);

//    for(j=0;j<2;j++)
//    {
//		printf("%s\n",question[j].que);
//		for(i=0;i<4;i++)
//		{
//			printf("%c.%s\t",(i+65),question[j].ans[i]);
//		}
//		printf("\n");
//		printf("你的答案是：");
//		scanf("%c,",&a[j]); 
//     	printf("a=%c,rans=%c\n",a[j],question[j].rans+65); 
//		if(a[j]==question[j].rans+65)
//		{
//			printf("正确");
//			printf("\n"); 
//		}
//		else
//		{
//			printf("错误，正确答案是：%c",question[j].rans+65);
//			printf("\n");
//		}    	
//	}
//	printf("!!!!!!!因为输入的错误，第一题请跳过\n");
//	printf("!!!!!!!跳过方法：按3次回车\n");
	printf("!!!!!!!因为未做对大小写字母的优化，请仅用大写字母作答\n");
	printf("!!!!!!!由于输入原因，答案之前不应有空格和回车，答案后是回车\n");
	printf("\n");
	printf("\n");
	while(1)
	{
//		cnt++;
//		printf("%d\n",cnt);
        srand((unsigned)time(0)); 
		j=rand()%SIZE+0;
//		printf("j=%d\n",j);
        printf("--------------------------------------------------------------------------\n") ;
		printf("%s\n",question[j].que);
		for(i=0;i<4;i++)
		{
			printf("%c.%s\t",(i+65),question[j].ans[i]);
		}
		printf("\n");
		printf("你的答案是："); 
//		scanf("%c,",&b);
		scanf("%s,",a); 
		
//		if(a[j]==question[j].rans)
		if(!strcmp(a,question[j].rans))
		{
			printf("正确\n");
//			printf("实际输入的是%s结束",a);
//			printf("\n"); 
		}
		else
		{
			printf("错误，正确答案是：%s\n",question[j].rans);
//			printf("实际输入的是%s结束",a);
//			printf("\n");
		} 	
		printf("--------------------------------------------------------------------------\n\n") ;	
	}
//	printf("%s\n",question[0].que);
//	for(i=0;i<4;i++)
//	{
//		printf("%c.%s\t",(i+65),question[0].ans[i]);
//	}
//	printf("\n");
//	printf("你的答案是：");
//	scanf("%c",&a); 
//	if(a==question[0].rans+65)
//	{
//		printf("正确");
//		printf("\n"); 
//	}
//	else
//	{
//		printf("错误，正确答案是：%c",question[0].rans+65);
//		printf("\n");
//	}
	
//	printf("答案是：%s",que1.ans[1]);
    return 0;
} 
//接收的逻辑不清楚，可以学学C语言接收数据的方法 
